app/controllers/comments_controller.rb

	def create
		@post = Post.find(params[:post_id])
		if @post.comments.create(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("author", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "Gustavo"], ["body", "Wow we have a working comment box!"], ["post_id", 1], ["created_at", "2016-04-05 04:25:09.577548"], ["updated_at", "2016-04-05 04:25:09.577548"]]