app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "author", "ISBN", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "War"], ["author", "That one Guy"], ["ISBN", 1865626], ["body", "Boom!"], ["created_at", "2016-04-26 01:11:01.212787"], ["updated_at", "2016-04-26 01:11:01.212787"]]
---
  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "subject" = ?, "price" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["subject", "Math"], ["price", 1], ["updated_at", "2016-04-26 20:49:42.776053"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)